[
    {
        "date": "2024-07-02",
        "location": "Feel Good Centre",
        "lesson": true,
        "description": "Today I went to my first Swim Dr session. I learned to get my head under water by holding on to the edge and bending my knees. The instructor, Brice, said the goal was to get my whole face under water. I'm happy that I managed this quite quickly. I learned to stay calm whilst breathing out in the water. Then I progressed to lifting my feet and breathing face down in the water. I learned that you need to just blink the water out of your eyes whilst breathing in and then put your face in the water again. I had a tendency to stop, wipe my face and go again. Then the instructor got me to do the same but start kicking my feet and gave me a float. It was a challenge to think about staying calm and breathing and also kick my feet. I feel that my legs aren;t strong so they get tired quickly. The instructor said you learn to kick in your own way like leaving a baby to learn how to walk. I think Brice is a good teacher and managed all the students well despite us all working on different things and at different levels. I want to commit to going on a Wednesday morning 3 times a month."
    },
    {
        "date": "2024-02-14",
        "location": "Feel Good Centre",
        "lesson": true,
        "description": "Kicking was a lot easier for me this week! At first my legs were getting tired but I told myself to relax them and tune into what was working. I kind of kicked from the knees down whilst being concious of making the chain of movement begin from the hips. Breathing and kicking at the same type were challenging but I managed to do couple of half lengths without stopping. At the end of the session the teacher got us all to practice treading in the deep end. I had a noodle and stayed at the edge. It was nice. He said keep your chin above the water and march like a soldier."
    },
    {
        "date": "2024-02-21",
        "location":"Feel Good Centre",
        "lesson": true,
        "description": "Today I ended up going to the 12pm session instead of 8am as I did a poor job of going to bed on time. So this time I had a different teacher. She was in the pool with us and got me to start with a float and practice kicking and breathing. I found it quite tiring and hard. After a while she told me to try without the float by holding my hands together infront of me (it's called the rocket). When she told me not to rush it and relax I felt like I started to get the hand of it. I'd go under water, breathe and kick every time I did it. It felt like progress. As a group she then got us to float on our backs and then roll forwards into treading by bringing knees into chest and arms out. I've always been able to float on my back but adding treading water was exciting. I'd like her to be my teacher but that means swtiching to 12pm sessions! I like starting early though and then having the rest of the day for other things on my list." 
    }
]